### juptyer 사용방법
* h : help
- a,b : 셀 추가
* m,y : 마크업 또는 코드
* dd : 셀 한칸 삿제
* 컨트롤 + 엔터 : 실행

In [20]:
#pandas 불러옴
import pandas as pd

In [21]:
# 데이터 읽기
df = pd.read_csv("data/1.pandas.csv")

In [22]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [23]:
#Series : 1차원 배열
#[]Serices 형식으로 가져온다
print(df['name']) 
print(df.age)

0     Kim
1     Cho
2    Choi
3      jo
Name: name, dtype: object
0    20
1    30
2    40
3    50
Name: age, dtype: int64

In [24]:
#[[]]DataFrame 형식으로 가져온다
print(df[['name']])

   name
0   Kim
1   Cho
2  Choi
3    jo

In [25]:
print(df[['name','age']])
print("---인덱싱---")

   name  age
0   Kim   20
1   Cho   30
2  Choi   40
3    jo   50
---인덱싱---

In [26]:
#인덱싱 : 인덱스의 범위를 지정한다.
print(df[1:3]) # 1~2까지의 데이터
print(df[:3]) #처음부터 ~2까지의 데이터
print(df[1:]) #1~끝까지의 데이터

   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

### loc : DF.loc[ index조건식, 컬럼 조건식 ]

In [28]:
print(df.loc[1:3, 'name'])

print(df.loc[1:3, ['name','score']])

print(df.loc[:, 'name':'grade'])

print( df.loc[1:3, ])

1     Cho
2    Choi
3      jo
Name: name, dtype: object
   name  score
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
   name  score grade
0   Kim  100.0     A
1   Cho   95.0     A
2  Choi   90.5     B
3    jo   85.7     B
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [29]:
print("================")
print( df['grade']=='A')
print(df[ df['grade']=='A'])

================
0     True
1     True
2    False
3    False
Name: grade, dtype: bool
  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

### Data Frame 삭제
* 인덱스를 기분으로 행 삭제

In [30]:
df.drop(2)

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [31]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [32]:
df = df.drop(3)
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40

In [34]:
df.drop(1, inplace = True)

In [35]:
df

   name  score grade  age
0   Kim  100.0     A   20
2  Choi   90.5     B   40

### axis
* 열 또는 행 중에 어떠한 값을 기준으로 설정할지 결정
* axic는 기본적으로 행("index")로 설정되면 axis = 0 이다.
* axic = 0 : index 삭제
* axic = 1 : 컬럼, 열 삭제

In [38]:
df.drop(0, axis =0, inplace=True)
df

   name  score grade  age
2  Choi   90.5     B   40

In [41]:
df.drop("score", axis=1, inplace=True)
df

   name grade  age
2  Choi     B   40

### Boolean 처리
* 특정 데이터 연산하면 결과는 True, False 이다.
* DataFrame에 True값을 전달하면 해당 위치의 값들을 얻어온다.

In [42]:
df = pd.read_csv('data/1.pandas.csv')
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [45]:
df[df['score']<95]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [47]:
df[df['score']<95][['name']]

   name
2  Choi
3    jo

In [49]:
df.loc[ df['score']<95 , 'name']

2    Choi
3      jo
Name: name, dtype: object

In [50]:
df[df['score']<95][['name','score']]

   name  score
2  Choi   90.5
3    jo   85.7

In [51]:
df.loc[df['score']<95, ['name', 'score']]

   name  score
2  Choi   90.5
3    jo   85.7

#슬라이싱

In [52]:
df.loc[df['score']<95, 'name':'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

In [53]:
df[df['score']<95].loc[:,'name':'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

### DataFrame 명령어

In [54]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [55]:
df.columns

Index(['name', 'score', 'grade', 'age'], dtype='object')

In [56]:
df.values

array([['Kim', 100.0, 'A', 20],
       ['Cho', 95.0, 'A', 30],
       ['Choi', 90.5, 'B', 40],
       ['jo', 85.7, 'B', 50]], dtype=object)

* dtypes
    - 자료형을 알려준다.
    - object : 문자열
    - float : 실수
    - int : 정수

In [57]:
df.dtypes

name      object
score    float64
grade     object
age        int64
dtype: object

In [59]:
df['grade']

0    A
1    A
2    B
3    B
Name: grade, dtype: object

In [60]:
df['grade'].isin(['A'])

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

In [61]:
df[df['grade'].isin(['A'])]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [64]:
df.loc[df['grade'].isin(['A']), ['name','grade']]

  name grade
0  Kim     A
1  Cho     A

In [66]:
index_name = ['김씨1','김씨2','김씨3','김씨4' ]
df.index = index_name
df

     name  score grade  age
김씨1   Kim  100.0     A   20
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40
김씨4    jo   85.7     B   50

In [67]:
df[1:3]

     name  score grade  age
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40

In [68]:
df['김씨2':'김씨3']

     name  score grade  age
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40